package com.demo.encapsulationokhttp.bean;

import java.util.List;

public class Joke {

    /**
     * code : 1
     * msg : 数据返回成功
     * data : {"page":2,"totalCount":9590,"totalPage":959,"limit":10,"list":[{"content":"一天，小美和她男友开车出去兜风， 车快没油了，刚好旁边有个加油站，开过去的时候，突然一阵狂风把她男友的帽子刮跑了。小美的男友对她说：\u201c我去捡帽子，你帮我加油。\u201d男友刚跑开不远，就听到小美在他后面大喊：\u201c加油！加油！  ----分享自段子乐","updateTime":"2018-11-03 09:45:28"},{"content":"天将降大任于斯人也，必先卸其QQ，封其微博，删其微信，去其贴吧，收其电脑，夺其手机，摔其ipad，断其wifi，剪其网线，使其百无聊赖，然后静坐、喝茶、思过、锻炼、读书、弹琴、练字、明智、开悟、精进，而后必成大器也。  ----分享自段子乐","updateTime":"2018-11-03 09:45:16"},{"content":"今天在公园没事，用手机照相。旁边一个老太太正在锻炼，看着挺精神。突然要我给她照相，我一按快门，咔嚓，闪光灯亮了。老太太捂着腰说：\u201c你的闪光灯太亮闪着我腰了，今天没有五万就别想走。\u201d我：\u201c\u2026\u2026\u201d  ----分享自段子乐","updateTime":"2018-11-03 09:45:03"},{"content":"楼主最近做了见习银行大堂。今天又有顾客取款不肯用取款机坚持要人工，所以就跟保安大叔吐槽：从我第一次用银行卡到现在，我取款从未在柜台取过，都是在ATM。结果保安大叔来了句：你没在柜台上取过款，说明你取款从来没超过两万呐，暴露的是你贫穷的事实，面对买理财的保安大叔，我只想说：人...  展开  ----分享自段子乐","updateTime":"2018-11-03 09:44:44"},{"content":"二嫂：小美，昨晚与那位男朋友见面结果怎样？小美：我早就说过，我喜欢找个大度的男人做男朋友，这人不符合我的要求，我和他一见面就拜拜了。二嫂：你口口声声说想找个大肚的男朋友，我好不容易才给你物色到这么个大肚的人。可你........小美：他大度个屁呀，一接触我就看出他是个小肚鸡肠的人。二嫂：你是不是晚上没看清楚呀？在我们公司那么多人里，就数他的肚是最大的了，这么大肚的人，你还嫌小，你想找多大肚的人呀？小美：........  收起  ----分享自段子","updateTime":"2018-11-03 09:44:15"},{"content":"一银行行长去洗车，熟识的洗车店员林子突问：\u201c你们银行是怎么赚钱的？\u201d行长用专业术语回答：\u201c主要是三块，授信类业务、中间业务和资产类业务。\u201d林子一脸茫然：\u201c啊！能说的简明点吗？\u201d行长想了想，说：\u201c就是高利贷、乱收费，外加拉皮条。\u201d  ----分享自段子乐","updateTime":"2018-11-03 09:43:57"},{"content":"老王的媳妇躺在我怀里，指着鸟笼的鹦鹉说:\u201c待会走的时候，把它处理掉，等老王回来就说飞走了\u201d我问:\u201c为什么？\u201d老王媳妇:\u201c这鹦鹉会说话，等老王回来了，非把我们的破事说出去不可\u201d于是我把鹦鹉带回了家不久我外地出差，半月后回来，一进门，老婆就对我说:\u201c老李，不好了，你的鹦鹉飞走了\u201d我:\u201c啊~\u201d  ----分享自段子乐","updateTime":"2018-11-03 09:43:46"},{"content":"每次对生活感到厌倦的时候，就想跟媳妇吵个架，然后听她信誓旦旦地吵着离婚，然后我就特别激动，觉得生活还是很有盼头的，崭新的未来仿佛就在眼前。  ----分享自段子乐","updateTime":"2018-11-03 09:43:05"},{"content":"刚才接一陌生电话\u201c喂，你好!\u201d,\u201c我是保险公司的，请问您在开车吗？\u201d,\u201c我不开，司机开。\u201d,\u201c您去哪？\u201d,\u201c在去上海的路上。\u201d,\u201c您的车有保险吗？\u201d,\u201c应该有吧，我没问过，回头我问问。\u201d,\u201c您坐的车值多少钱呀？\u201d,\u201c没问过，估计有几个亿吧。\u201d,\u201c大哥，您啥车呀？\u201d,\u201c高铁！\u201d,啪的一声，电话挂了??,脾气还挺大，我说错了吗？??  收起  ----分享自段子乐","updateTime":"2018-11-03 09:42:53"},{"content":"昨晚和领导一起吃火锅。领导用筷子夹最后一个牛肉丸，费了很大劲怎么也夹不上来。刚好汤匙在我手上，我就把牛肉丸盛起来。可能是喝多了，脑子一抽我把牛肉丸盛我自己碗里了\u2026\u2026\n当时一桌人都用钦佩的眼神看着我！","updateTime":"2018-10-18 04:11:34"}]}
     */

    /**
     * page : 2
     * totalCount : 9590
     * totalPage : 959
     * limit : 10
     * list : [{"content":"一天，小美和她男友开车出去兜风， 车快没油了，刚好旁边有个加油站，开过去的时候，突然一阵狂风把她男友的帽子刮跑了。小美的男友对她说：\u201c我去捡帽子，你帮我加油。\u201d男友刚跑开不远，就听到小美在他后面大喊：\u201c加油！加油！  ----分享自段子乐","updateTime":"2018-11-03 09:45:28"},{"content":"天将降大任于斯人也，必先卸其QQ，封其微博，删其微信，去其贴吧，收其电脑，夺其手机，摔其ipad，断其wifi，剪其网线，使其百无聊赖，然后静坐、喝茶、思过、锻炼、读书、弹琴、练字、明智、开悟、精进，而后必成大器也。  ----分享自段子乐","updateTime":"2018-11-03 09:45:16"},{"content":"今天在公园没事，用手机照相。旁边一个老太太正在锻炼，看着挺精神。突然要我给她照相，我一按快门，咔嚓，闪光灯亮了。老太太捂着腰说：\u201c你的闪光灯太亮闪着我腰了，今天没有五万就别想走。\u201d我：\u201c\u2026\u2026\u201d  ----分享自段子乐","updateTime":"2018-11-03 09:45:03"},{"content":"楼主最近做了见习银行大堂。今天又有顾客取款不肯用取款机坚持要人工，所以就跟保安大叔吐槽：从我第一次用银行卡到现在，我取款从未在柜台取过，都是在ATM。结果保安大叔来了句：你没在柜台上取过款，说明你取款从来没超过两万呐，暴露的是你贫穷的事实，面对买理财的保安大叔，我只想说：人...  展开  ----分享自段子乐","updateTime":"2018-11-03 09:44:44"},{"content":"二嫂：小美，昨晚与那位男朋友见面结果怎样？小美：我早就说过，我喜欢找个大度的男人做男朋友，这人不符合我的要求，我和他一见面就拜拜了。二嫂：你口口声声说想找个大肚的男朋友，我好不容易才给你物色到这么个大肚的人。可你........小美：他大度个屁呀，一接触我就看出他是个小肚鸡肠的人。二嫂：你是不是晚上没看清楚呀？在我们公司那么多人里，就数他的肚是最大的了，这么大肚的人，你还嫌小，你想找多大肚的人呀？小美：........  收起  ----分享自段子","updateTime":"2018-11-03 09:44:15"},{"content":"一银行行长去洗车，熟识的洗车店员林子突问：\u201c你们银行是怎么赚钱的？\u201d行长用专业术语回答：\u201c主要是三块，授信类业务、中间业务和资产类业务。\u201d林子一脸茫然：\u201c啊！能说的简明点吗？\u201d行长想了想，说：\u201c就是高利贷、乱收费，外加拉皮条。\u201d  ----分享自段子乐","updateTime":"2018-11-03 09:43:57"},{"content":"老王的媳妇躺在我怀里，指着鸟笼的鹦鹉说:\u201c待会走的时候，把它处理掉，等老王回来就说飞走了\u201d我问:\u201c为什么？\u201d老王媳妇:\u201c这鹦鹉会说话，等老王回来了，非把我们的破事说出去不可\u201d于是我把鹦鹉带回了家不久我外地出差，半月后回来，一进门，老婆就对我说:\u201c老李，不好了，你的鹦鹉飞走了\u201d我:\u201c啊~\u201d  ----分享自段子乐","updateTime":"2018-11-03 09:43:46"},{"content":"每次对生活感到厌倦的时候，就想跟媳妇吵个架，然后听她信誓旦旦地吵着离婚，然后我就特别激动，觉得生活还是很有盼头的，崭新的未来仿佛就在眼前。  ----分享自段子乐","updateTime":"2018-11-03 09:43:05"},{"content":"刚才接一陌生电话\u201c喂，你好!\u201d,\u201c我是保险公司的，请问您在开车吗？\u201d,\u201c我不开，司机开。\u201d,\u201c您去哪？\u201d,\u201c在去上海的路上。\u201d,\u201c您的车有保险吗？\u201d,\u201c应该有吧，我没问过，回头我问问。\u201d,\u201c您坐的车值多少钱呀？\u201d,\u201c没问过，估计有几个亿吧。\u201d,\u201c大哥，您啥车呀？\u201d,\u201c高铁！\u201d,啪的一声，电话挂了??,脾气还挺大，我说错了吗？??  收起  ----分享自段子乐","updateTime":"2018-11-03 09:42:53"},{"content":"昨晚和领导一起吃火锅。领导用筷子夹最后一个牛肉丸，费了很大劲怎么也夹不上来。刚好汤匙在我手上，我就把牛肉丸盛起来。可能是喝多了，脑子一抽我把牛肉丸盛我自己碗里了\u2026\u2026\n当时一桌人都用钦佩的眼神看着我！","updateTime":"2018-10-18 04:11:34"}]
     */

    private int page;
    private int totalCount;
    private int totalPage;
    private int limit;
    private List<ListBean> list;

    public int getPage() {
        return page;
    }

    public void setPage(int page) {
        this.page = page;
    }

    public int getTotalCount() {
        return totalCount;
    }

    public void setTotalCount(int totalCount) {
        this.totalCount = totalCount;
    }

    public int getTotalPage() {
        return totalPage;
    }

    public void setTotalPage(int totalPage) {
        this.totalPage = totalPage;
    }

    public int getLimit() {
        return limit;
    }

    public void setLimit(int limit) {
        this.limit = limit;
    }

    public List<ListBean> getList() {
        return list;
    }

    public void setList(List<ListBean> list) {
        this.list = list;
    }

    public static class ListBean {
        /**
         * content : 一天，小美和她男友开车出去兜风， 车快没油了，刚好旁边有个加油站，开过去的时候，突然一阵狂风把她男友的帽子刮跑了。小美的男友对她说：“我去捡帽子，你帮我加油。”男友刚跑开不远，就听到小美在他后面大喊：“加油！加油！  ----分享自段子乐
         * updateTime : 2018-11-03 09:45:28
         */

        private String content;
        private String updateTime;

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getUpdateTime() {
            return updateTime;
        }

        public void setUpdateTime(String updateTime) {
            this.updateTime = updateTime;
        }
    }
}
